// 1. Вивести в консоль всі числа від 1 до 10 за допомогою циклу while.

// let i = 0;

// while (i <= 10) {
//   i += 1;

//   console.log(i);
// }

// 2. Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for.
// Якщо число парне, пропустити його за допомогою continue.

// const max = 20;

// for (let i = 2; i <= max; i += 1) {
//   if (i % 2 !== 0) {
//     continue;
//   }
//   console.log(i);
// }

// 3. Вивести в консоль таблицю множення числа 7 за допомогою циклу for.

// for (let i = 1; i <= 10; i += 1) {
//   console.log(`7 * ${i} = ${7 * i}`);
// }

// 4. і 5. пропускаємо

// 6. Створити скрипт, який виводить в консоль всі числа ,
//  які менші за n. Якщо зустрічається число, що більше або дорівнює n,
// цикл повинен бути закінчений за допомогою break.

// const n = 10;

// for (let i = 0; i <= n; i += 1) {
//   if (i >= n) {
//     break;
//   }
//   console.log(i);
// }

// 7. За допомогою циклу while вивести в консоль всі числа від 1 до 20,
// крім чисел, кратних 3. Якщо зустрінете число, кратне 3,
//  цикл повинен продовжити виконання за допомогою оператора continue.

// let i = 1;

// const max = 20;

// while (i <= max) {
//   if (i % 3 === 0) {
//     i += 1;
//     continue;
//   }
//   console.log(i);
//   i += 1;
// }
